0.1.0/tutorials/incompressible/dym-pimple/oscillating_inlet_acmi_2d/system/controlDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      controlDict;
}

application     dym-pimple;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         5;
deltaT          0.005;
writeControl    adjustableRunTime;
writeInterval   0.05;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
adjustTimeStep  true;
maxCo           0.5;

// vim: set ft=foam et sw=2 ts=2 sts=2:
