0.1.0/tutorials/incompressible/dym-pimple/oscillating_inlet_acmi_2d/constant/dynamicMeshDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      dynamicMeshDict;
}

dynamicFvMesh   solidBodyMotionFvMesh;
motionSolverLibs ( "libfvMotionSolvers.so" );
solidBodyMotionFvMeshCoeffs
{
  cellZone        inletChannel;
  solidBodyMotionFunction  oscillatingLinearMotion;
  oscillatingLinearMotionCoeffs
  {
    amplitude       (0 0.5 0);
    omega           3.14; // rad/s  (.5 rps)
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
