0.1.0/tutorials/incompressible/dym-pimple/oscillating_inlet_acmi_2d/0.org/U
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  location    "0";
  object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
  inlet
  {
    type            fixedValue;
    value           uniform (1 0 0);
  }
  outlet
  {
    type            pressureInletOutletVelocity;
    value           uniform (0 0 0);
  }
  walls
  {
//        type            fixedValue;
    type            movingWallVelocity;
    value           uniform (0 0 0);
  }
  defaultFaces
  {
    type            empty;
  }
  ACMI1_blockage
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
  ACMI1_couple
  {
    type            cyclicACMI;
    value           uniform (0 0 0);
  }
  ACMI2_blockage
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
  ACMI2_couple
  {
    type            cyclicACMI;
    value           uniform (0 0 0);
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
