0.1.0/tutorials/incompressible/dym-pimple/oscillating_inlet_acmi_2d/system/fvSchemes
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSchemes;
}

ddtSchemes
{
  default         Euler;
}
gradSchemes
{
  default         Gauss linear;
  grad(p)         Gauss linear;
  grad(U)         cellLimited Gauss linear 1;
}
divSchemes
{
  default         none;
//    div(phi,U)      Gauss upwind;
  div(phi,U)      Gauss linearUpwind grad(U);
  div(phi,k)      Gauss upwind;
  div(phi,epsilon) Gauss upwind;
  div((nuEff*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes
{
  default         Gauss linear limited corrected 0.33;
}
interpolationSchemes
{
  default         linear;
}
snGradSchemes
{
  default         limited corrected 0.33;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
