0.1.0/tutorials/incompressible/dym-pimple/oscillating_inlet_acmi_2d/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      fvSolution;
}

solvers
{
  pcorr
  {
    solver          GAMG;
    tolerance       1e-2;
    relTol          0;
    smoother        GaussSeidel;
    cacheAgglomeration no;
    nCellsInCoarsestLevel 10;
    agglomerator    faceAreaPair;
    mergeLevels     1;
    maxIter         50;
  }
  p
  {
    $pcorr;
    tolerance       1e-5;
    relTol          0.01;
  }
  pFinal
  {
    $p;
    tolerance       1e-6;
    relTol          0;
  }
  "(U|k|epsilon)"
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-6;
    relTol          0.1;
  }
  "(U|k|epsilon)Final"
  {
    $U;
    tolerance       1e-6;
    relTol          0;
  }
}
PIMPLE
{
  correctPhi          no;
  nOuterCorrectors    1;
  nCorrectors         2;
  nNonOrthogonalCorrectors 0;
}
relaxationFactors
{
//    "(U|k|epsilon).*"   1;
}
cache
{
  grad(U);
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
