0.1.0/tutorials/incompressible/dym-pimple/oscillating_inlet_acmi_2d/system/createBafflesDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      createBafflesDict;
}

// Whether to convert internal faces only (so leave boundary faces intact).
// This is only relevant if your face selection type can pick up boundary
// faces.
internalFacesOnly false;
// Baffles to create.
baffles
{
  // NOTE: cyclicAMI patches MUST BE defined PRIOR to their associted
  //       blockage patches
  ACMI1
  {
    //- Use predefined faceZone to select faces and orientation.
    type        faceZone;
    zoneName    couple1Faces;
    patches
    {
      master
      {
        //- Master side patch
        name            ACMI1_couple;
        type            cyclicACMI;
        matchTolerance  0.0001;
        neighbourPatch  ACMI2_couple;
        nonOverlapPatch ACMI1_blockage;
        transform       noOrdering;
      }
      slave // not used since we're manipulating a boundary patch
      {
        //- Slave side patch
        name            ACMI1_couple;
        type            patch;
      }
      master2
      {
        //- Master side patch
        name            ACMI1_blockage;
        type            wall;
      }
      slave2 // not used since we're manipulating a boundary patch
      {
        //- Slave side patch
        name            ACMI1_blockage;
        type            wall;
      }
    }
  }
  ACMI2
  {
    //- Use predefined faceZone to select faces and orientation.
    type        faceZone;
    zoneName    couple2Faces;
    patches
    {
      master
      {
        //- Master side patch
        name            ACMI2_couple;
        type            cyclicACMI;
        matchTolerance  0.0001;
        neighbourPatch  ACMI1_couple;
        nonOverlapPatch ACMI2_blockage;
        transform       noOrdering;
      }
      slave // not used since we're manipulating a boundary patch
      {
        //- Slave side patch
        name            ACMI2_couple;
        type            patch;
      }
      master2
      {
        //- Master side patch
        name            ACMI2_blockage;
        type            wall;
      }
      slave2 // not used since we're manipulating a boundary patch
      {
        //- Slave side patch
        name            ACMI2_blockage;
        type            wall;
      }
    }
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
